# Curso Pandas - Exercícios

## Informações de um DataFrame

In [2]:
import pandas as pd
data = [['Fulano',12,7.0,True], ['Sicrano',15,3.5,False],['Beltrano',18,9.3,True]]
dados = pd.DataFrame(data, columns = ['Nome','Idade','Nota','Situação'])
dados

       Nome  Idade  Nota  Situação
0    Fulano     12   7.0      True
1   Sicrano     15   3.5     False
2  Beltrano     18   9.3      True

In [15]:
dados.dtypes
tipos_de_dados = pd.DataFrame(dados.dtypes, columns = ['Tipos de Dados'])

In [17]:
tipos_de_dados.columns.name = 'Variáveis'

In [18]:
tipos_de_dados

Variáveis Tipos de Dados
Nome              object
Idade              int64
Nota             float64
Situação            bool

In [20]:
print(f'A base de dados possui {dados.shape[0]} registros (alunos) e {dados.shape[1]} variáveis (nota,nome..)')

A base de dados possui 3 registros (alunos) e 4 variáveis (nota,nome..)

## Criação de um DataFrame

In [3]:
import pandas as pd
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})

pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [7]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [21]:

dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')

columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [15]:
help(.split())

SyntaxError: invalid syntax (2871150536.py, line 1)

## Determinando seleções

In [2]:
import pandas as pd

numeros = [i for i in range(11)]
letras = [chr(i + 65) for i in range(11)]
nome_coluna = ['N']

df = pd.DataFrame(data = numeros, index = letras, columns = nome_coluna)
df

    N
A   0
B   1
C   2
D   3
E   4
F   5
G   6
H   7
I   8
J   9
K  10

In [3]:
selecao = df['N'].isin([i for i in range(11) if i % 2 == 0])
df = df[selecao]
df

    N
A   0
C   2
E   4
G   6
I   8
K  10

## Organizando DataFrame
Transforme df_A em df_B

In [5]:
import pandas as pd
df_A = [['Ary','M',21],['Catia','F',19],['Carlos','M',50],['Beto','M',29],['Bruna','F',31],['Ana','F',42]]
df_A = pd.DataFrame(data=df_A,columns=['Nome','Sexo','Idade'],index=[0,1,2,3,4,5])
df_A

     Nome Sexo  Idade
0     Ary    M     21
1   Catia    F     19
2  Carlos    M     50
3    Beto    M     29
4   Bruna    F     31
5     Ana    F     42

In [7]:
df_B = df_A.sort_values(by=['Sexo','Nome'],axis=0)
df_B

     Nome Sexo  Idade
5     Ana    F     42
4   Bruna    F     31
1   Catia    F     19
0     Ary    M     21
3    Beto    M     29
2  Carlos    M     50

In [9]:
#Seleção de DataFrames
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [10]:
#Alunos aprovados
selecao = alunos['Aprovado'] == True
n1 = alunos[selecao]
n1

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [12]:
#Alunas F Aprovadas
selecao = (alunos['Aprovado'] == True) & (alunos['Sexo'] == 'F')
n2 = alunos[selecao]
n2

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [16]:
#Entre 10 e 20 anos ou maior igual a 40
selecao = ((alunos['Idade'] > 10) & (alunos['Idade'] < 20)) | (alunos['Idade'] >= 40)
n3 = alunos[selecao]
n3

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False

## Selecionando DataFrames
Crie um DataFrame somente com os alunos reprovados e mantenha neste DataFrame apenas as colunas Nome, Sexo e Idade nesta ordem.

In [7]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [9]:
selecao = alunos['Aprovado'] == False
selecao

0    False
1     True
2     True
3    False
4    False
5    False
6     True
7     True
Name: Aprovado, dtype: bool

In [11]:
reprovados = alunos[selecao].loc[:,['Nome','Sexo','Idade']]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [13]:
reprovados = alunos[selecao].iloc[:,[0,2,1]]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [15]:
reprovados = alunos.loc[selecao,['Nome','Sexo','Idade']]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [19]:
reprovados = alunos[selecao][['Nome','Sexo','Idade']]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [21]:
reprovados = alunos[['Nome','Sexo','Idade']][selecao]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

Crie uma visualização com os tres alunos mais novos.

In [23]:
alunos.sort_values(by = 'Idade', inplace=True)
alunos.iloc[:3,:]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True

Revisando processo 5

In [2]:
import pandas as pd

In [3]:
imoveis = pd.DataFrame([['Apartamento', None, 970, 68], 
                        ['Apartamento', 2000, 878, 112], 
                        ['Casa', 5000, None, 500], 
                        ['Apartamento', None, 1010, 170], 
                        ['Apartamento', 1500, 850, None], 
                        ['Casa', None, None, None], 
                        ['Apartamento', 2000, 878, None], 
                        ['Apartamento', 1550, None, 228], 
                        ['Apartamento', 2500, 880, 195]], 
                        columns = ['Tipo', 'Valor', 'Condominio', 'IPTU'])
imoveis

          Tipo   Valor  Condominio   IPTU
0  Apartamento     NaN       970.0   68.0
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         NaN  500.0
3  Apartamento     NaN      1010.0  170.0
4  Apartamento  1500.0       850.0    NaN
5         Casa     NaN         NaN    NaN
6  Apartamento  2000.0       878.0    NaN
7  Apartamento  1550.0         NaN  228.0
8  Apartamento  2500.0       880.0  195.0

In [4]:
imoveis.dropna(subset=['Valor'],inplace=True)
imoveis

          Tipo   Valor  Condominio   IPTU
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         NaN  500.0
4  Apartamento  1500.0       850.0    NaN
6  Apartamento  2000.0       878.0    NaN
7  Apartamento  1550.0         NaN  228.0
8  Apartamento  2500.0       880.0  195.0

In [9]:

selecao = (imoveis['Tipo'] == 'Apartamento') & (imoveis['Condominio'].isnull())
imoveis = imoveis[~selecao]
imoveis.shape[0]
imoveis

          Tipo   Valor  Condominio   IPTU
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         NaN  500.0
4  Apartamento  1500.0       850.0    NaN
6  Apartamento  2000.0       878.0    NaN
8  Apartamento  2500.0       880.0  195.0

In [10]:
imoveis.fillna({'Condominio' : 0, 'IPTU' : 0},inplace=True)
imoveis

          Tipo   Valor  Condominio   IPTU
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         0.0  500.0
4  Apartamento  1500.0       850.0    0.0
6  Apartamento  2000.0       878.0    0.0
8  Apartamento  2500.0       880.0  195.0

In [11]:
imoveis.index = range(0,imoveis.shape[0])
imoveis

          Tipo   Valor  Condominio   IPTU
0  Apartamento  2000.0       878.0  112.0
1         Casa  5000.0         0.0  500.0
2  Apartamento  1500.0       850.0    0.0
3  Apartamento  2000.0       878.0    0.0
4  Apartamento  2500.0       880.0  195.0

### Preenchendo dados Faltantes

In [6]:
import pandas as pd
atletas = pd.DataFrame([['Marcos', 9.62], ['Pedro', None], ['João', 9.69], 
                        ['Beto', 9.72], ['Sandro', None], ['Denis', 9.69], 
                        ['Ary', None], ['Carlos', 9.74]], 
                        columns = ['Corredor', 'Melhor Tempo'])
atletas

  Corredor  Melhor Tempo
0   Marcos          9.62
1    Pedro           NaN
2     João          9.69
3     Beto          9.72
4   Sandro           NaN
5    Denis          9.69
6      Ary           NaN
7   Carlos          9.74

In [10]:
atletas.fillna(value = atletas['Melhor Tempo'].mean(),inplace=True)
atletas

  Corredor  Melhor Tempo
0   Marcos         9.620
1    Pedro         9.692
2     João         9.690
3     Beto         9.720
4   Sandro         9.692
5    Denis         9.690
6      Ary         9.692
7   Carlos         9.740

Criação de Váriaveis

In [1]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas'])
alunos

     Nome  Idade Sexo  Notas
0     Ary     15    M    7.5
1   Cátia     27    F    2.5
2   Denis     56    M    5.0
3    Beto     32    M   10.0
4   Bruna     42    F    8.2
5    Dara     21    F    7.0
6  Carlos     19    M    6.0
7   Alice     35    F    5.6

In [2]:
alunos['Notas-Média(Notas)'] = alunos['Notas'] - alunos['Notas'].mean()

In [4]:
alunos['Notas-Média(Notas)'] = alunos['Notas'].apply(lambda x: x - alunos['Notas'].mean())

In [7]:
alunos['Faixa Etária'] = alunos['Idade'].apply(lambda x: 'Menor q 20 anos' if (x<20) else 'Entre 20 e 40 anos' if (x >= 20 and x <= 40) else 'Maior q 40 anos')
alunos

     Nome  Idade Sexo  Notas  Notas-Média(Notas)        Faixa Etária
0     Ary     15    M    7.5               1.025     Menor q 20 anos
1   Cátia     27    F    2.5              -3.975  Entre 20 e 40 anos
2   Denis     56    M    5.0              -1.475     Maior q 40 anos
3    Beto     32    M   10.0               3.525  Entre 20 e 40 anos
4   Bruna     42    F    8.2               1.725     Maior q 40 anos
5    Dara     21    F    7.0               0.525  Entre 20 e 40 anos
6  Carlos     19    M    6.0              -0.475     Menor q 20 anos
7   Alice     35    F    5.6              -0.875  Entre 20 e 40 anos

    Faces   m1  m2  m3  m4  m5
C   Coroa   freqM1  ..  ..  ..
c   cara    freqM2  ..  ..  ..
Monte o DataFrame acima, para testarmos quais moedas são viciadas.

In [8]:
m1 = 'CCcCCccCCCccCcCccCcCcCCCcCCcccCCcCcCcCcccCCcCcccCc'
m2 = 'CCCCCccCccCcCCCCccCccccCccCccCCcCccCcCcCCcCccCccCc'
m3 = 'CccCCccCcCCCCCCCCCCcccCccCCCCCCccCCCcccCCCcCCcccCC'
m4 = 'cCCccCCccCCccCCccccCcCcCcCcCcCcCCCCccccCCCcCCcCCCC'
m5 = 'CCCcCcCcCcCCCcCCcCcCCccCcCCcccCccCCcCcCcCcCcccccCc'

In [10]:
df = pd.DataFrame([['Coroa', 'fM1', 'fM2', 'fM3', 'fM4', 'fM5'], ['Cara', 'fm1', 'fm2', 'fm3', 'fm4', 'fm5']], columns=['Faces','m1', 'm2', 'm3', 'm4', 'm5'], index=['C','c'])
df

   Faces   m1   m2   m3   m4   m5
C  Coroa  fM1  fM2  fM3  fM4  fM5
c   Cara  fm1  fm2  fm3  fm4  fm5

In [14]:
df['m1'] = pd.Series(list(m1)).value_counts()
df

   Faces  m1   m2   m3   m4   m5
C  Coroa  25  fM2  fM3  fM4  fM5
c   Cara  25  fm2  fm3  fm4  fm5

In [16]:
pd.Series(list(m2)).value_counts()

c    26
C    24
dtype: int64

In [19]:
df['m3'] = pd.Series(list(m3)).value_counts()
df['m4'] = pd.Series(list(m4)).value_counts()
df['m5'] = pd.Series(list(m5)).value_counts()

In [20]:
df

   Faces  m1  m2  m3  m4  m5
C  Coroa  25  24  31  27  25
c   Cara  25  26  19  23  25

In [28]:
eventos = {'m1' : list(m1), 'm2' : list(m2), 'm3' : list(m3), 'm4' : list(m4), 'm5' : list(m5)}
moedas = pd.DataFrame(eventos)
df = pd.DataFrame(data= ['Cara','Coroa'], index=['c','C'], columns=['Faces'])
df

   Faces
c   Cara
C  Coroa

In [29]:
for item in moedas:
    df = pd.concat([df, moedas[item].value_counts()], axis=1)
df

   Faces  m1  m2  m3  m4  m5
c   Cara  25  26  19  23  25
C  Coroa  25  24  31  27  25

Agrupamentos em DataFrame. groupby(). Obtenha um DataFrame com as notas médias dos alunos, com 2 casas decimais, segundo o sexo

In [9]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [11]:
grupo_sexo = alunos.groupby('Sexo')
sexo = pd.DataFrame(grupo_sexo['Notas'].mean().round(2))
sexo.columns = ['Notas Médias']
sexo

      Notas Médias
Sexo
F             5.82
M             7.12

Criando DataFrame agrupado por produtos e exibindo análises estatísticas

In [2]:
import pandas as pd
precos = pd.DataFrame([['Feira', 'Cebola', 2.5], 
                        ['Mercado', 'Cebola', 1.99], 
                        ['Supermercado', 'Cebola', 1.69], 
                        ['Feira', 'Tomate', 4], 
                        ['Mercado', 'Tomate', 3.29], 
                        ['Supermercado', 'Tomate', 2.99], 
                        ['Feira', 'Batata', 4.2], 
                        ['Mercado', 'Batata', 3.99], 
                        ['Supermercado', 'Batata', 3.69]], 
                        columns = ['Local', 'Produto', 'Preço'])
precos

          Local Produto  Preço
0         Feira  Cebola   2.50
1       Mercado  Cebola   1.99
2  Supermercado  Cebola   1.69
3         Feira  Tomate   4.00
4       Mercado  Tomate   3.29
5  Supermercado  Tomate   2.99
6         Feira  Batata   4.20
7       Mercado  Batata   3.99
8  Supermercado  Batata   3.69

In [3]:
produtos = precos.groupby('Produto')
produtos.describe().round(2)

        Preço
        count  mean   std   min   25%   50%   75%  max
Produto
Batata    3.0  3.96  0.26  3.69  3.84  3.99  4.10  4.2
Cebola    3.0  2.06  0.41  1.69  1.84  1.99  2.24  2.5
Tomate    3.0  3.43  0.52  2.99  3.14  3.29  3.64  4.0

In [5]:
estatisticas = ['mean', 'std', 'min', 'max']
nomes = {'mean':'Média', 'std':'Desvio Padrão', 'min':'Mínimo', 'max':'Máximo'}
produtos['Preço'].aggregate(estatisticas).rename(columns=nomes).round(2)

         Média  Desvio Padrão  Mínimo  Máximo
Produto
Batata    3.96           0.26    3.69     4.2
Cebola    2.06           0.41    1.69     2.5
Tomate    3.43           0.52    2.99     4.0

Obtenha os quartis e IIQ do df (Valor do m2) abaixo

In [6]:
import pandas as pd
import matplotlib as plt

In [7]:
df = pd.read_csv('dados/aluguel_amostra.csv', sep=';')
df.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Apartamento,Recreio dos Bandeirantes,3,2,1,320,3200.0,1319.0,0.0,10.00,Apartamento
1,Apartamento,Maracanã,2,0,0,59,800.0,725.0,47.0,13.56,Apartamento
2,Apartamento,Leblon,3,2,1,147,7500.0,1000.0,381.0,51.02,Apartamento
3,Apartamento,São Conrado,3,3,3,270,14999.0,2800.0,1200.0,55.55,Apartamento
4,Apartamento,Tijuca,2,1,0,65,1200.0,640.0,97.0,18.46,Apartamento

In [14]:
Q1 = df['Valor m2'].quantile(0.25)
Q3 = df['Valor m2'].quantile(0.75)
IIQ = (Q3 - Q1).round(2)

In [15]:
print(f'Q1 -> {Q1} \nQ3 -> {Q3} \nIIQ -> {IIQ}')

Q1 -> 21.25
Q3 -> 42.31
IIQ -> 21.06

In [17]:
limite_inferior = (Q1 - 1.5*IIQ).round(2)
limite_superior = (Q3 + 1.5*IIQ).round(2)
print(f'limite inferior - {limite_inferior} \n limite superior - {limite_superior}')

limite inferior - -10.34
 limite superior - 73.9